### Learning  Pandas Part : I Starter

In [1]:
import pandas as pd
from pandas import Series,DataFrame
import numpy as np

##### Pandas has two data structure: Series and DataFrame
###### 1. Series :  One dimensional array like oobject containing a sequence of values as associated array of data labels, called index.It is like dictionary and can be used in many contexts where dictiionary might be used.

In [9]:
s1=pd.Series([1,2,3,4,5]) # Here we have not assigned index,thus default index starts from zero to n-1,
                          #where n :number of element 
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [14]:
s2=pd.Series([1,2,3,4],index=['a','b','c','d'])
s2

a    1
b    2
c    3
d    4
dtype: int64

In [3]:
s1.values # .values gives the element/memeber of the Series

array([1, 2, 3, 4, 5], dtype=int64)

In [9]:
s1.values[3] # gives the third positioned value/member

4

In [12]:
s2.values[3]

4

In [4]:
s1.index # .index gives the start stop and step of the index

RangeIndex(start=0, stop=5, step=1)

In [14]:
s2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [21]:
s1.index[2]

2

In [13]:
s2.index[2]

'c'

In [21]:
s1[3] # pasing the index key inside square bracket we can call the corresponding member

4

In [23]:
s2['d']

4

In [18]:
s1[[1,4,0]] # By passing list  of index inside square bracket, we can call corresponding members at once

1    2
4    5
0    1
dtype: int64

In [28]:
s3=s2[['c','d','a']] # Assigning to a new Seris is alo possible
s3

c    3
d    4
a    1
dtype: int64

In [28]:
s3['c']=5 # value can be changed like this 
s3

c    5
d    4
a    1
dtype: int64

In [27]:
s2

a    1
b    2
c    3
d    4
dtype: int64

In [37]:
1 in s1 # Using in  we can check wheter an index is present in the Series or not

True

In [34]:
'b'in s3

False

In [35]:
'd'in s3

True

Series can be created from Dictionary directly

In [31]:
fruit={'Apple':5,'Mango':10,'Banana':3,'Grape':8,'Orange':3}
fruit

{'Apple': 5, 'Mango': 10, 'Banana': 3, 'Grape': 8, 'Orange': 3}

In [35]:
s_fruit1=pd.Series(fruit)
s_fruit1

Apple      5
Mango     10
Banana     3
Grape      8
Orange     3
dtype: int64

In [36]:
# The order in which you want to display the fruit name (index) can be changed like this:
fruit_index=['Apple','Banana','Grape','Guava','Mango','Orange']#Note Guava is not there in dict:fruit, thus NaN appears
s_fruit2=pd.Series(fruit,index=fruit_index)
s_fruit2

Apple      5.0
Banana     3.0
Grape      8.0
Guava      NaN
Mango     10.0
Orange     3.0
dtype: float64

In [37]:
# It automatically allign by index label in arithmatic operations:
fruit_total=s_fruit1+s_fruit2
fruit_total

Apple     10.0
Banana     6.0
Grape     16.0
Guava      NaN
Mango     20.0
Orange     6.0
dtype: float64

In [52]:
#Name attribute can be used to give name of index and the Series object itself.
fruit_total.name='Fruit and its amount in kg'
fruit_total.index.name='Fruit Name'
fruit_total

Fruit Name
Apple     10.0
Banana     6.0
Grape     16.0
Guava      NaN
Mango     20.0
Orange     6.0
Name: Fruit and its amount in kg, dtype: float64

In [39]:
# Series index can be altered in place by assignment :> s1.index=['..',..,..,'..']
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [41]:
s1.index=['Bob','John','Adam','Mathew','Smith']
s1.index.name='Name of student'
s1.name='Number of absentism of students'
s1

Name of student
Bob       1
John      2
Adam      3
Mathew    4
Smith     5
Name: Number of absentism of students, dtype: int64

###### Note:
NuPpy functions or NumPy-like operations, such as filtering with a boolean array, 
scalar multiplication, or applying math  functions, will preserve the index-value link.

In [43]:
s2[s2>2]

c    3
d    4
dtype: int64

In [30]:
s3*6

c    30
d    24
a     6
dtype: int64

In [44]:
np.exp(s3)

c    20.085537
d    54.598150
a     2.718282
dtype: float64

### 2. DataFrame 
It is rectangular table of data and contains an ordered collection of columns, each of which can be a different value type:numeric, string, boolean, etc.It has both a row and column index.

In [47]:
# Dictiionary of equal lenght list can be used to construct a DataFrame
data={'Name':['Francis','Larry','Nicole','Joy','Sam','John','Adam'],'Subject Stream':['English','Maths','Biology','Physics','Computing','English','Math'],'Score':[435,234,986,562,12,600,900]}
data

{'Name': ['Francis', 'Larry', 'Nicole', 'Joy', 'Sam', 'John', 'Adam'],
 'Subject Stream': ['English',
  'Maths',
  'Biology',
  'Physics',
  'Computing',
  'English',
  'Math'],
 'Score': [435, 234, 986, 562, 12, 600, 900]}

In [82]:
f1=pd.DataFrame(data) #Passing the above dict to make DataFrame,index is automatically added, can be edited as in Series
f1

      Name Subject Stream  Score
0  Francis        English    435
1    Larry          Maths    234
2   Nicole        Biology    986
3      Joy        Physics    562
4      Sam      Computing     12
5     John        English    600
6     Adam           Math    900

In [62]:
f1.head() # Give the first five entries, you can pass number of entries you want inside the parenthesis, 
# similarly for last entries : f1.tail()

      Name Subject Stream  Score
0  Francis        English    435
1    Larry          Maths    234
2   Nicole        Biology    986
3      Joy        Physics    562
4      Sam      Computing     12

In [118]:
# Re-arranging the column:
pd.DataFrame(f1,columns=['Subject Stream','Name','Score','Category'])
#Assignment to a new dataframe is also valid : f2=pd.DataFrame(f1,[...............])
# If you pass a column name that is not there then the column will be added with NaN as all the values, like 'Category, above

  Subject Stream     Name  Score  Category
0        English  Francis    435       NaN
1          Maths    Larry    234       NaN
2        Biology   Nicole    986       NaN
3        Physics      Joy    562       NaN
4      Computing      Sam     12       NaN
5        English     John    600       NaN
6           Math     Adam    900       NaN

In [49]:
f1.values# values attribute returns the data contained in DataFrame as two dimensional ndarray.

array([['Francis', 'English', 435],
       ['Larry', 'Maths', 234],
       ['Nicole', 'Biology', 986],
       ['Joy', 'Physics', 562],
       ['Sam', 'Computing', 12],
       ['John', 'English', 600],
       ['Adam', 'Math', 900]], dtype=object)

In [50]:
a=f1.values
a[1]

array(['Larry', 'Maths', 234], dtype=object)

In [70]:
#Nested dict can be passed to form DataFrame, where outer keys form the column name and inner becomes the rows
int_rate={'SBI':{2001:5,2005:7,2010:12},'PNB':{2001:6,2005:7,2010:9}}# This is nested dictionary
int_rate

{'SBI': {2001: 5, 2005: 7, 2010: 12}, 'PNB': {2001: 6, 2005: 7, 2010: 9}}

In [71]:
rate_d=pd.DataFrame(int_rate)
rate_d

      SBI  PNB
2001    5    6
2005    7    7
2010   12    9

In [72]:
# Swapping  rows and columns with > .T (Actuqally it is traspose)
rate_d.T

     2001  2005  2010
SBI     5     7    12
PNB     6     7     9

### Retrieving and Manipulating Rows , Columns

In [88]:
f1

      Name Subject Stream  Score
0  Francis        English    435
1    Larry          Maths    234
2   Nicole        Biology    986
3      Joy        Physics    562
4      Sam      Computing     12
5     John        English    600
6     Adam           Math    900

In [84]:
f1['Subject Stream']=='English'

0     True
1    False
2    False
3    False
4    False
5     True
6    False
Name: Subject Stream, dtype: bool

In [74]:
# Retrieval of a column
f1['Name'] # or >> f1.Name # But for later, 'column name' should be a valid variable name
# Assignment is also valid : f2=f1['Name']

0    Francis
1      Larry
2     Nicole
3        Joy
4        Sam
5       John
6       Adam
Name: Name, dtype: object

In [97]:
f1['Subject Stream']=='English'

one       True
two      False
three    False
four     False
five     False
six       True
seven    False
Name: Subject Stream, dtype: bool

In [90]:
f1[f1['Subject Stream']=='English']

      Name Subject Stream  Score
0  Francis        English    435
5     John        English    600

In [141]:
# Columns can be modified and added by assignment
f1['Grade']=['A','B','C','D','E','F','G']
f1

      Name Subject Stream  Score  CGPA  Remarks Grade
0  Francis        English    435   NaN    False     A
1    Larry          Maths    234   NaN    False     B
2   Nicole        Biology    986   NaN    False     C
3      Joy        Physics    562  10.0     True     D
4      Sam      Computing     12   7.0    False     E
5     John        English    600   NaN    False     F
6     Adam           Math    900   8.0     True     G

In [142]:
# A column can be added by making series, value will be filled at corrsponding specified index
# Additional index with value will not be added, here 7 and 8.
value=pd.Series([10,9,8,7,0],index=[3,7,6,4,8]) 
f1['CGPA']=value
f1

      Name Subject Stream  Score  CGPA  Remarks Grade
0  Francis        English    435   NaN    False     A
1    Larry          Maths    234   NaN    False     B
2   Nicole        Biology    986   NaN    False     C
3      Joy        Physics    562  10.0     True     D
4      Sam      Computing     12   7.0    False     E
5     John        English    600   NaN    False     F
6     Adam           Math    900   8.0     True     G

In [143]:
f1['Remarks']=f1['CGPA']>=8 # A column Remarks is added with 'True' value where condition satisfies
f1

      Name Subject Stream  Score  CGPA  Remarks Grade
0  Francis        English    435   NaN    False     A
1    Larry          Maths    234   NaN    False     B
2   Nicole        Biology    986   NaN    False     C
3      Joy        Physics    562  10.0     True     D
4      Sam      Computing     12   7.0    False     E
5     John        English    600   NaN    False     F
6     Adam           Math    900   8.0     True     G

In [144]:
f1.drop(['CGPA','Remarks'],axis=1,inplace=True)  ## for removing multiple columns,'inplace= False' will give only a view
f1 # while 'inplace=True apply changes in the original DataFrame'
## f1.drop(f1.iloc[:, 1:3], inplace = True, axis = 1): we can delete this way as well

      Name Subject Stream  Score Grade
0  Francis        English    435     A
1    Larry          Maths    234     B
2   Nicole        Biology    986     C
3      Joy        Physics    562     D
4      Sam      Computing     12     E
5     John        English    600     F
6     Adam           Math    900     G

In [145]:
del f1['Grade'] # del can be used for single column deletion
f1

      Name Subject Stream  Score
0  Francis        English    435
1    Larry          Maths    234
2   Nicole        Biology    986
3      Joy        Physics    562
4      Sam      Computing     12
5     John        English    600
6     Adam           Math    900

#####  Retrieval of rows >> .loc :label based indexing  / .iloc :Positional indexing (retrieval from index reference only)

In [146]:
f1=pd.DataFrame(data,index=['one','two','three','four','five','six','seven'])
f1

          Name Subject Stream  Score
one    Francis        English    435
two      Larry          Maths    234
three   Nicole        Biology    986
four       Joy        Physics    562
five       Sam      Computing     12
six       John        English    600
seven     Adam           Math    900

In [152]:
f1[['Name','Score']]# retrieval of single column or sequence of columns, for single column :> f1['Name']

          Name  Score
one    Francis    435
two      Larry    234
three   Nicole    986
four       Joy    562
five       Sam     12
six       John    600
seven     Adam    900

In [153]:

f1.loc[['four','six']] ## selects singe row or sequence of row by index label ,for single row :> f1.loc['four']

      Name Subject Stream  Score
four   Joy        Physics    562
six   John        English    600

In [154]:
f1.loc['two','Score']#Selects both row and column by label.Here :> row-'two'  and column-'Score'

234

In [157]:
f1.loc[:,'Name']

one      Francis
two        Larry
three     Nicole
four         Joy
five         Sam
six         John
seven       Adam
Name: Name, dtype: object

In [158]:
f1.loc['four',['Name','Score']]

Name     Joy
Score    562
Name: four, dtype: object

In [183]:
f1.loc[['one','four'],['Name','Score']]

         Name  Score
one   Francis    435
four      Joy    562

In [159]:
f1.iloc[4] # selects by positinal indexing,note that index counting starts from zero
# Positional index are by default present or present hiddenly.

Name                    Sam
Subject Stream    Computing
Score                    12
Name: five, dtype: object

In [161]:
f1.iloc[:,1] #selects single column or multiple if sequence is passed as :> f1.iloc[:,[0,1]]

          Name Subject Stream
one    Francis        English
two      Larry          Maths
three   Nicole        Biology
four       Joy        Physics
five       Sam      Computing
six       John        English
seven     Adam           Math

In [162]:
f1.iloc[4,1] # Both row and column by inter positon. Here :> selects fourtth row and first column
# OR :> f1.iat[4,1]

'Computing'

In [163]:
f1.iat[4,1]

'Computing'

In [184]:
f1.iloc[1,[2,1]]

Score               234
Subject Stream    Maths
Name: two, dtype: object

In [185]:
f1.iloc[[0,3],[0,2]]

         Name  Score
one   Francis    435
four      Joy    562

In [187]:
f1.iloc[:,:2]

          Name Subject Stream
one    Francis        English
two      Larry          Maths
three   Nicole        Biology
four       Joy        Physics
five       Sam      Computing
six       John        English
seven     Adam           Math

In [188]:
f1.iloc[2:,:]

         Name Subject Stream  Score
three  Nicole        Biology    986
four      Joy        Physics    562
five      Sam      Computing     12
six      John        English    600
seven    Adam           Math    900

##### Essential functionality
.reindex :>Note that it only change the location of index along with its value

In [165]:
obj1=pd.Series([4.5,7.2,-5.3,3.6],index=['d','b','a','c'])
obj1

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [166]:
obj2=obj1.reindex(['a','b','c','d','e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [129]:
# method=ffill: it is used for forwrad fill
obj2.reindex(['a','b','c','d','e','f'],method='ffill')

a    20.0
b     NaN
c     NaN
d     NaN
e    40.0
f    40.0
dtype: float64

In [167]:
# columns can also be reindexed with column keyword
f1.reindex(columns=['Name','Score','Subject Stream'])

          Name  Score Subject Stream
one    Francis    435        English
two      Larry    234          Maths
three   Nicole    986        Biology
four       Joy    562        Physics
five       Sam     12      Computing
six       John    600        English
seven     Adam    900           Math

In [170]:
f1.reindex(columns=['Score','Subject Stream','Name'])

       Score Subject Stream     Name
one      435        English  Francis
two      234          Maths    Larry
three    986        Biology   Nicole
four     562        Physics      Joy
five      12      Computing      Sam
six      600        English     John
seven    900           Math     Adam

##### Dropping Entries from an Axis :> Axis 0= row & Axis 1 = column

In [132]:
new_f1=f1.drop(0)# for single row put the row index,for multiple row put the list of rows inside parentheis
new_f1           # for removing rows seperately 'axis=0 'is not required to declare as :> new_f1=f1.drop(0,axis=0)

     Name Subject Stream  Score
1   Larry          Maths    234
2  Nicole        Biology    986
3     Joy        Physics    562
4     Sam      Computing     12
5    John        English    600
6    Adam           Math    900

In [133]:
new_f2=f1.drop([3,6])
new_f2

      Name Subject Stream  Score
0  Francis        English    435
1    Larry          Maths    234
2   Nicole        Biology    986
4      Sam      Computing     12
5     John        English    600

In [134]:
new_f3=f1.drop(['Name','Score'],axis=1)
new_f3

  Subject Stream
0        English
1          Maths
2        Biology
3        Physics
4      Computing
5        English
6           Math

##### Indexing ,Selection and Filtering
Series indexing (obj[...]) works analogously to Numpy array indexing, except Series index values can alo be used insted of only integers.

### Series

In [175]:
ob1=pd.Series([1,2,3,4,5,6],index=['d','b','a','c','e','f'])
ob1

d    1
b    2
a    3
c    4
e    5
f    6
dtype: int64

In [177]:
ob1['b':'e']# both b and e included, Assignment is also valid, like :> ob1['b':'e']=22

b    2
a    3
c    4
e    5
dtype: int64

In [178]:
ob1[1:4] # 1 to 3rd but 4rth value is not included

b    2
a    3
c    4
dtype: int64

In [179]:
ob1[ob1>=5]

e    5
f    6
dtype: int64

###  DataFrame
###### Indexing into a DataFrame is for retrieving:> one column by passing single value ( obj [...]  ) or
###### More column by passing list of value inside the squre bracket  (  obj [ [...] ] ).

In [180]:
d1=pd.DataFrame(data)
d1['CGPA']=['C','F','A+','B','F','B+','A']
d1

      Name Subject Stream  Score CGPA
0  Francis        English    435    C
1    Larry          Maths    234    F
2   Nicole        Biology    986   A+
3      Joy        Physics    562    B
4      Sam      Computing     12    F
5     John        English    600   B+
6     Adam           Math    900    A

In [181]:
d1.index=['one','two','three','four','five','six','seven']
d1

          Name Subject Stream  Score CGPA
one    Francis        English    435    C
two      Larry          Maths    234    F
three   Nicole        Biology    986   A+
four       Joy        Physics    562    B
five       Sam      Computing     12    F
six       John        English    600   B+
seven     Adam           Math    900    A

In [182]:
d1['CGPA']

one       C
two       F
three    A+
four      B
five      F
six      B+
seven     A
Name: CGPA, dtype: object

In [183]:
d1[['Name','CGPA']]

          Name CGPA
one    Francis    C
two      Larry    F
three   Nicole   A+
four       Joy    B
five       Sam    F
six       John   B+
seven     Adam    A

### Exception :
1. slicing  array :> d1[1:5] or d1[:4] or d1[3:] :> Gives rows. But passing  a single element or a list to the [ ] operator selects columns.
2. Selecting the boolean :> d1[(d1['CGPA']=='A')|(d1['CGPA']=='A+')]  : > Gives rows.

In [184]:
d1[3:] # 3rd row included

       Name Subject Stream  Score CGPA
four    Joy        Physics    562    B
five    Sam      Computing     12    F
six    John        English    600   B+
seven  Adam           Math    900    A

In [185]:
d1[:4] # upto 3rd but 4rth excluded.

          Name Subject Stream  Score CGPA
one    Francis        English    435    C
two      Larry          Maths    234    F
three   Nicole        Biology    986   A+
four       Joy        Physics    562    B

In [167]:
d1[1:5] # 1st included 5th excluded

         Name Subject Stream  Score CGPA
two     Larry          Maths    234    F
three  Nicole        Biology    986   A+
four      Joy        Physics    562    B
five      Sam      Computing     12    F

In [176]:
d1[(d1['CGPA']=='A')|(d1['CGPA']=='A+')]

         Name Subject Stream  Score CGPA
three  Nicole        Biology    986   A+
seven    Adam           Math    900    A

### Arithmetic and Data Alignment

In [194]:
# Two Series addition 
s1=pd.Series(np.arange(5),index=['a','b','c','d','e'])
s2=pd.Series(np.arange(1,10,2),index=['a','c','e','g','i'])
s1+s2# Internal data alignment introduces missing values in the label that don't overlap.
# Resulting index will be the union of the index pair.

a    1.0
b    NaN
c    5.0
d    NaN
e    9.0
g    NaN
i    NaN
dtype: float64

In [186]:
# DataFrame Addition
df1=pd.DataFrame(np.arange(9).reshape((3,3)),columns=['apple','mango','banana'],index=['John','Jack','Jil'])
df2=pd.DataFrame(np.arange(12).reshape((4,3)),columns=['apple','guava','banana'],index=['Adam','John','Jack','Jil'])
df1

      apple  mango  banana
John      0      1       2
Jack      3      4       5
Jil       6      7       8

In [187]:
df2

      apple  guava  banana
Adam      0      1       2
John      3      4       5
Jack      6      7       8
Jil       9     10      11

In [199]:
df1+df2# adding these together results in NaN values in the locations that don't overlap

      apple  banana  guava  mango
Adam    NaN     NaN    NaN    NaN
Jack    9.0    13.0    NaN    NaN
Jil    15.0    19.0    NaN    NaN
John    3.0     7.0    NaN    NaN

#### Arithmetic methods with fill values

In arithmatic operatios , you might want to fill with a special value,
like 0 (could be anything) when an axis label is found in one object but not in other.

In [189]:
df1.rsub(df2,fill_value=0)

      apple  banana  guava  mango
Adam    0.0     2.0    1.0    NaN
Jack    3.0     3.0    7.0   -4.0
Jil     3.0     3.0   10.0   -7.0
John    3.0     3.0    4.0   -1.0

In [207]:
df1.rsub(df2,fill_value=0)# adding 'r' infront of 'sub', argument flipped as :>  df2-df1

      apple  banana  guava  mango
Adam    0.0     2.0    1.0    NaN
Jack    3.0     3.0    7.0   -4.0
Jil     3.0     3.0   10.0   -7.0
John    3.0     3.0    4.0   -1.0

###### Arithmetic methods
    add, radd >(+)
    sub, rsub >(-)
    div, rdiv >(/)
    floordiv, rfloordiv >(//)
    mul , rmul >(*)
    pow , rpow >(**)

#### Arithmetic Operations between DataFrame and Series:Broadcasting down the array and columns:Similar to numpy array

In [209]:
df2

      apple  guava  banana
Adam      0      1       2
John      3      4       5
Jack      6      7       8
Jil       9     10      11

In [210]:
ss1=df2.iloc[1]
ss1

apple     3
guava     4
banana    5
Name: John, dtype: int32

In [211]:
df2-ss1 # subtracted after broadcasting down the  row

      apple  guava  banana
Adam     -3     -3      -3
John      0      0       0
Jack      3      3       3
Jil       6      6       6

In [214]:
ss2=df2['apple']
ss2

Adam    0
John    3
Jack    6
Jil     9
Name: apple, dtype: int32

In [217]:
df2-ss2 # No logical result

      Adam  Jack  Jil  John  apple  banana  guava
Adam   NaN   NaN  NaN   NaN    NaN     NaN    NaN
John   NaN   NaN  NaN   NaN    NaN     NaN    NaN
Jack   NaN   NaN  NaN   NaN    NaN     NaN    NaN
Jil    NaN   NaN  NaN   NaN    NaN     NaN    NaN

In [216]:
# To subtract after broadcasting over column requires arithmetic method and passing of axis=0 or axis='index'
df2.sub(ss2,axis=0)

      apple  guava  banana
Adam      0      1       2
John      0      1       2
Jack      0      1       2
Jil       0      1       2

### NumPy Universal functions (Element-wise array methods) also work with pandas objects.

In [193]:
df1=pd.DataFrame((np.arange(1,13,1)*1.75).reshape(4,3),columns=['Mon','Tue','Wed'],index=['Mango','Jackfruit','W.Melon','Pineapple'])
df1

             Mon    Tue    Wed
Mango       1.75   3.50   5.25
Jackfruit   7.00   8.75  10.50
W.Melon    12.25  14.00  15.75
Pineapple  17.50  19.25  21.00

In [195]:
np.max(df1)

Mon    17.50
Tue    19.25
Wed    21.00
dtype: float64

In [196]:
np.max(df1,axis=1)

Mango         5.25
Jackfruit    10.50
W.Melon      15.75
Pineapple    21.00
dtype: float64

In [194]:
np.power(df1,2)

                Mon       Tue       Wed
Mango        3.0625   12.2500   27.5625
Jackfruit   49.0000   76.5625  110.2500
W.Melon    150.0625  196.0000  248.0625
Pineapple  306.2500  370.5625  441.0000

Revise: How universal functions are used in NumPy.

### Anonymous (Lambda) Functions:
Python has support for so called anonymous or lambda functions, which are a way of writing functions consisting of a single statement, the result of which is the return value.They are defined with the lambda keyword, which has no meaning other than "we are declaring an anonymous functions:"
        
    def sqr_f(x):
        return x**2
                  
Above functions can be written in one line using lambda as:'
         
    sqr_f=lambda x:x**2
        
In pandas and many application we pass the functions as argument.In this case lambda way of making functions is easy/handy and clearer to use.

### Note:> ' apply '  method is used to applying a function on one dimensional array to each column or row as above, more examples given below.

In [202]:
df1

             Mon    Tue    Wed
Mango       1.75   3.50   5.25
Jackfruit   7.00   8.75  10.50
W.Melon    12.25  14.00  15.75
Pineapple  17.50  19.25  21.00

In [45]:
f=lambda x: x.max()-x.min() # Now this lambda function can be passed as argument using apply method as below:
df1.apply(f) # We haven't declared the axis thus it applies to axis, zero(row-wise)automatically.

Mon    15.75
Tue    15.75
Wed    15.75
dtype: float64

In [46]:
df1.apply(f,axis=1) # It acts columns wise

Mango        3.5
Jackfruit    3.5
W.Melon      3.5
Pineapple    3.5
dtype: float64

In [203]:
f1=lambda x: pd.Series([x.min(),x.max()],index=['min','max'])
df1.apply(f1,axis=0)

       Mon    Tue    Wed
min   1.75   3.50   5.25
max  17.50  19.25  21.00

In [201]:
f=lambda x:pd.Series([x.min(), x.max()],index=['Max','Min'])
df1.apply(f,axis=1)

             Max    Min
Mango       1.75   5.25
Jackfruit   7.00  10.50
W.Melon    12.25  15.75
Pineapple  17.50  21.00

In [50]:
df2=np.power(df1,2)
df2

                Mon       Tue       Wed
Mango        3.0625   12.2500   27.5625
Jackfruit   49.0000   76.5625  110.2500
W.Melon    150.0625  196.0000  248.0625
Pineapple  306.2500  370.5625  441.0000

##### ' applymap ' is another method for Element-wise python functions application.

In [204]:
f1=lambda x: '%.2f' % x # Returns each element with only two decimal points
df3=df2.applymap(f1)
df3

     apple  guava banana
Adam  0.00   1.00   2.00
John  3.00   4.00   5.00
Jack  6.00   7.00   8.00
Jil   9.00  10.00  11.00

## Sorting

In [207]:
df3

     apple  guava banana
Adam  0.00   1.00   2.00
John  3.00   4.00   5.00
Jack  6.00   7.00   8.00
Jil   9.00  10.00  11.00

In [206]:
df3.sort_index() # axis can be passed

     apple  guava banana
Adam  0.00   1.00   2.00
Jack  6.00   7.00   8.00
Jil   9.00  10.00  11.00
John  3.00   4.00   5.00

In [208]:
df3.sort_index(axis=1)#

     apple banana  guava
Adam  0.00   2.00   1.00
John  3.00   5.00   4.00
Jack  6.00   8.00   7.00
Jil   9.00  11.00  10.00

In [209]:
# Data is sorted in ascending order by default which can be made descending by passing ascending =False
df3.sort_index(axis=1,ascending=False)

      guava banana apple
Adam   1.00   2.00  0.00
John   4.00   5.00  3.00
Jack   7.00   8.00  6.00
Jil   10.00  11.00  9.00

In [210]:
df1

             Mon    Tue    Wed
Mango       1.75   3.50   5.25
Jackfruit   7.00   8.75  10.50
W.Melon    12.25  14.00  15.75
Pineapple  17.50  19.25  21.00

In [211]:
df1.sort_values(by='Tue',ascending=False) # only applies for column name, multiple can be passed by making list of names

             Mon    Tue    Wed
Pineapple  17.50  19.25  21.00
W.Melon    12.25  14.00  15.75
Jackfruit   7.00   8.75  10.50
Mango       1.75   3.50   5.25

## Descriptive statistics

In [213]:
df1

             Mon    Tue    Wed
Mango       1.75   3.50   5.25
Jackfruit   7.00   8.75  10.50
W.Melon    12.25  14.00  15.75
Pineapple  17.50  19.25  21.00

In [82]:
df1.sum()# axis can be passed,by default it takes 0 i.e. row-wise operation

Mon    38.5
Tue    45.5
Wed    52.5
dtype: float64

In [212]:
df1.sum(axis=1)# column-wise operation.Or> :df1.sum(axis='columns')

Mango        10.50
Jackfruit    26.25
W.Melon      42.00
Pineapple    57.75
dtype: float64

In [214]:
df1.iloc[0,1]=np.nan # putting NaN at this location

In [215]:
df1

             Mon    Tue    Wed
Mango       1.75    NaN   5.25
Jackfruit   7.00   8.75  10.50
W.Melon    12.25  14.00  15.75
Pineapple  17.50  19.25  21.00

In [216]:
df1.sum()# Automatically handles  missing data:NA values are excluded unless the entire slice(row or column) in NA
         #This automatic handling can be disabled by passing > skinpna=Flse

Mon    38.5
Tue    42.0
Wed    52.5
dtype: float64

In [217]:
df1.sum(skipna=False)

Mon    38.5
Tue     NaN
Wed    52.5
dtype: float64

In [89]:
df1.cumsum() # calculates cumulative sum

             Mon    Tue    Wed
Mango       1.75    NaN   5.25
Jackfruit   8.75   8.75  15.75
W.Melon    21.00  22.75  31.50
Pineapple  38.50  42.00  52.50

In [90]:
df1.cumsum(axis=1) #

             Mon    Tue    Wed
Mango       1.75    NaN   7.00
Jackfruit   7.00  15.75  26.25
W.Melon    12.25  26.25  42.00
Pineapple  17.50  36.75  57.75

In [95]:
df1.describe()# this doesn't accept axis argument, describe can be used after Transposing ( .T )

             Mon     Tue        Wed
count   4.000000   3.000   4.000000
mean    9.625000  14.000  13.125000
std     6.777721   5.250   6.777721
min     1.750000   8.750   5.250000
25%     5.687500  11.375   9.187500
50%     9.625000  14.000  13.125000
75%    13.562500  16.625  17.062500
max    17.500000  19.250  21.000000

In [93]:
df1.T

     Mango  Jackfruit  W.Melon  Pineapple
Mon   1.75       7.00    12.25      17.50
Tue    NaN       8.75    14.00      19.25
Wed   5.25      10.50    15.75      21.00

In [94]:
df1.T.describe()

          Mango  Jackfruit  W.Melon  Pineapple
count  2.000000      3.000    3.000      3.000
mean   3.500000      8.750   14.000     19.250
std    2.474874      1.750    1.750      1.750
min    1.750000      7.000   12.250     17.500
25%    2.625000      7.875   13.125     18.375
50%    3.500000      8.750   14.000     19.250
75%    4.375000      9.625   14.875     20.125
max    5.250000     10.500   15.750     21.000

##### Check other methods:
count,min,max,argmin,argmax,idxmin,idxmax,quantile,sum,mean,median,prod,mad,var ,std,skew,kurt,cumsum,cummin,cummax,cumprod,diff,pct_change

### For Series :check > .unique() , .value_counts()  ,  .isin()

  ##                                            THANK YOU !